/*=====================================================================//
//	Name:		GameList.h
//	Desc:		头文件、全局变量、方法定义
//	Coder:		GooHome、EME
//	Date:		2009-12-23
//=====================================================================*/

#ifndef GameList_H
#define GameList_H

WCHAR m_lpImgPathBuf[MAX_PATH];

/**--------------------------------------------------------------------------------------
 * LoadGameList - 当前目录下的Hidden目录下的第一层目录加载都向量列表里
 * @m_GameList: 游戏列表数组
 *
 *文件目录结构：default.xex 执行文件
 *				default.txt 游戏文件说明（如果不存在，直接使用目录名）
 *				default.png 游戏图片
 * Returns：没有返回值（偷懒）
 * Author：GooHome
 * History：2009/12/12 初版做成
 --------------------------------------------------------------------------------------*/
VOID LoadGameList(GameList *m_GameList);


/**--------------------------------------------------------------------------------------
 * getGameTitle - 游戏文件说明
 * @lstrFileName: 游戏说明文件
 * @lpGameName: 游戏名
 *
 *文件目录结构：
 *				default.txt 游戏文件说明（如果不存在，直接使用目录名）
 * Returns：成功标志
 * Author：GooHome
 * History：2009/12/12 初版做成
 --------------------------------------------------------------------------------------*/
bool getGameTitle(char* lstrFileName,char* lpGameName);



//*========================================================================//
//	Name	:	SortList
//  Desc	:	对游戏列表进行排序
//	Param	: 
//			SortType:	排序的类型:
//										0	:	创建时间
//										1	:	其他...
//
//	Return	:	true - 挂载成功;flase - 挂载失败
//	Coder	:	EME
//	Date	:	2009-12-24
//========================================================================*/
VOID SortGameList(GameList *m_GameList, UINT SortType);

//*========================================================================//
//	Name	:	LoadConfig
//  Desc	:	读取配置文件
//	Param	: 
//	Return	:	没有返回值
//	Coder	:	EME
//	Date	:	2009-12-30
//========================================================================*/
VOID LoadConfig(VOID);

//*========================================================================//
//  Name	:	SaveConfig
//  Desc	:	保存配置文件
//	Param	: 
//	Return	:	没有返回值
//	Coder	:	EME
//	Date	:	2010-01-13
//========================================================================*/
VOID SaveConfig(VOID);
#endif